# Лабораторная работа. Настройка NAT для IPv4.

1. Создание сети и настройка начальных параметров устройств
2. Настройка интерфейсов маршрутизаторов и коммутаторов
3. Настройка и проверка NAT для IPv4
4. Настройка и проверка PAT для IPv4
5. Настройка и проверка статического NAT для IPv4.

## 1. Создание сети и настройка основных параметров устройств.

### 1.1 Создадим топологию данной сети в программе cisco packet tracer. 

![](net_topology.png)

### 1.2. Выполнение базовых настроек маршрутизаторов и коммутаторов (описание только для R1).

- Назначение имени устройства:
```
Router> enable
Router#configure terminal
Router(config)#hostname R1
```

- Отключение поиска DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введенные команды таким образом, как будто они являются именами узлов.

```
R1(config)#no ip domain-lookup
```

- Создадим пользоваеля admin с паролем cisco в качестве пароля.

```
R1(config)#username admin privilege 0 secret cisco
```

- Настройка использования локальной БД (с ранее заведенными пользвателем admin) для аутентификации доступа в консоль:

```
R1(config)#line console 0
R1(config-line)#login local
R1(config-line)#logging synchronous
R1(config-line)#exit
R1(config)#
```

- Настройка использования локальной БД (с ранее заведенными пользвателем admin) для аутентификации доступа к линиям VTY и отключение доступа к неактивному привилегированному режиму через заданное время:

```
R1(config)#line vty 0 15
R1(config-line)#exec-timeout 5 30
R1(config-line)#login local
R1(config-line)#exit
R1(config)#
```

- Настройка пароля для входа в привилегированный режим и настройка отображения этого пароля в неявном виде при выводе команды **show running-config**

```
R1(config)#enable secret class
R1(config)#service password-encryption
R1(config)#
```

- Настройка приветственного баннера:

```
R1(config)#banner motd $ Vy kto takie! Ya vas ne znayu! Idite naher! $
```

- Сохранение настроенной конфигурации устройства

```
R1#copy running-config startup-config
```

Для ускорения настройки соберем все команды в единый блок, который будет вставляться в консоль устройства посредством copy/paste:

```
enable
configure terminal
hostname S2
no ip domain-lookup
username admin privilege 0 secret cisco
line console 0
login local
logging synchronous
exit
line vty 0 15
exec-timeout 5 30
login local
exit
enable secret class
service password-encryption
banner motd $ Vy kto takie! Ya vas ne znayu! Idite naher! $
exit
wr
exit
```
## 2. Настройка интерфейсов маршрутизаторов и коммутаторов

## 2.1. Настройка маршрутизатора R2

```
R2(config)#interface g0/0
R2(config-if)#ip address 209.165.200.225 255.255.255.248
R2(config-if)#no sh
R2(config)#interface loopback 1
R2(config-if)#ip address 209.165.200.1 255.255.255.224
R2(config-if)#no sh
```

## 2.2. Настройка маршрутизатора R1

```
R1(config)#interface g0/0
R1(config-if)#ip address 209.165.200.230 255.255.255.248
R1(config-if)#no sh
R1(config)#interface g0/1
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no sh
```

Обязательно нужно настроить статический маршрут до сети, в которой настроен loopback интерфейс маршрутизатора R2, иначе до него не будет связности с маршрутизатора R1:

```
R1(config)#ip route 209.165.200.0 255.255.255.224 209.165.200.225
```

## 2.3. Настройка коммутатора S1

```
S1(config)#interface vlan 1
S1(config-if)#ip address 192.168.1.11 255.255.255.0
S1(config-if)#no sh
S1(config)#ip default-gateway 192.168.1.1
```

## 2.4. Настройка коммутатора S2

```
S2(config)#interface vlan 1
S2(config-if)#ip address 192.168.1.12 255.255.255.0
S2(config-if)#no sh
S2(config)#ip default-gateway 192.168.1.1
```

*Примечание: шлюз по умолчанию настраивается, потому что в дальнейшем мы будем пинговать с коммутаторов loopback интерфейс R1, то есть обращаться к узлу из внешней по отношению к коммутаторам сети.

## 3. Настройка и проверка динамического NAT

- Сначала нужно определить диапазон адресов, подлежащих трансляции с помощью стандартной ACL:
```
R1(config)#ip access-list standard LOCAL_NET
R1(config-std-nacl)#permit 192.168.1.0 0.0.0.255
```
- Затем нужно настроить пул глобальных адресов
```
R1(config)#ip nat pool GLOBAL_POOL 209.165.200.226 209.165.200.228 netmask 255.255.255.248
```
- Затем добавляем правило трансляции
```
R1(config)#ip nat inside source list LOCAL_NET pool GLOBAL_POOL
```
- И наконец включаем NAT-трансляцию на интерфейсах
```
R1(config)#interface GigabitEthernet0/1
R1(config)#ip nat inside
R1(config)#interface GigabitEthernet0/0
R1(config)#ip nat outside
```
- Проверяем результаты работы NAT
```
R1#show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:53192.168.1.3:53     209.165.200.1:53   209.165.200.1:53
icmp 209.165.200.226:54192.168.1.3:54     209.165.200.1:54   209.165.200.1:54
icmp 209.165.200.226:55192.168.1.3:55     209.165.200.1:55   209.165.200.1:55
icmp 209.165.200.226:56192.168.1.3:56     209.165.200.1:56   209.165.200.1:56
icmp 209.165.200.226:57192.168.1.3:57     209.165.200.1:57   209.165.200.1:57
icmp 209.165.200.226:58192.168.1.3:58     209.165.200.1:58   209.165.200.1:58
```

Как мы видим, локальный внутренний адрес PC-B 192.168.1.3 преобразовался в глобальный внутренний адрес 209.165.200.226 и пакет был смаршрутизирован на R2, так как R1 имеет статический маршрут до адресата, то есть Loopback интерфейса R2 209.165.200.1.

Затем включаем пинги с PC-A, а также S1 и S2.
```
R1# show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:336192.168.1.3:336    209.165.200.1:336  209.165.200.1:336
icmp 209.165.200.226:337192.168.1.3:337    209.165.200.1:337  209.165.200.1:337
icmp 209.165.200.226:338192.168.1.3:338    209.165.200.1:338  209.165.200.1:338
icmp 209.165.200.226:339192.168.1.3:339    209.165.200.1:339  209.165.200.1:339
icmp 209.165.200.227:41192.168.1.11:41    209.165.200.1:41   209.165.200.1:41
icmp 209.165.200.227:42192.168.1.11:42    209.165.200.1:42   209.165.200.1:42
icmp 209.165.200.227:43192.168.1.11:43    209.165.200.1:43   209.165.200.1:43
icmp 209.165.200.227:44192.168.1.11:44    209.165.200.1:44   209.165.200.1:44
icmp 209.165.200.227:45192.168.1.11:45    209.165.200.1:45   209.165.200.1:45
icmp 209.165.200.228:320192.168.1.2:320    209.165.200.1:320  209.165.200.1:320
icmp 209.165.200.228:321192.168.1.2:321    209.165.200.1:321  209.165.200.1:321
icmp 209.165.200.228:322192.168.1.2:322    209.165.200.1:322  209.165.200.1:322
icmp 209.165.200.228:323192.168.1.2:323    209.165.200.1:323  209.165.200.1:323
```
Как мы видим из вывода команды трансляции подверглись только 3 адреса  192.168.1.2, 192.168.1.3, 192.168.1.11. Трансляции адреса S2 не произошло по причине того, что в пуле глобальных NAT адресов всего 3 адреса. 

## 3. Настройка и проверка динамического PAT

- Для настройки динамического PAT необходимо сначала удалить старое правило преобразования NAT

```
R1(config)#no ip nat inside source list LOCAL_NET pool GLOBAL_POOL
```
- Далее нужно ввести новое правило, которое будет аналогично старому, но с параметром overload

```
R1(config)#ip nat inside source list LOCAL_NET pool GLOBAL_POOL overload
```
- Очистим журнал трансляций
```
R1#clear ip nat translation *
```
Запустим пинги c PC-A, PC-B, S1, S2
```
R1#show ip nat  translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.227:1024192.168.1.12:46    209.165.200.1:46   209.165.200.1:1024
icmp 209.165.200.227:1025192.168.1.12:47    209.165.200.1:47   209.165.200.1:1025
icmp 209.165.200.227:1026192.168.1.12:48    209.165.200.1:48   209.165.200.1:1026
icmp 209.165.200.227:1027192.168.1.12:49    209.165.200.1:49   209.165.200.1:1027
icmp 209.165.200.227:1028192.168.1.12:50    209.165.200.1:50   209.165.200.1:1028
icmp 209.165.200.227:324192.168.1.2:324    209.165.200.1:324  209.165.200.1:324
icmp 209.165.200.227:325192.168.1.2:325    209.165.200.1:325  209.165.200.1:325
icmp 209.165.200.227:326192.168.1.2:326    209.165.200.1:326  209.165.200.1:326
icmp 209.165.200.227:327192.168.1.2:327    209.165.200.1:327  209.165.200.1:327
icmp 209.165.200.227:340192.168.1.3:340    209.165.200.1:340  209.165.200.1:340
icmp 209.165.200.227:341192.168.1.3:341    209.165.200.1:341  209.165.200.1:341
icmp 209.165.200.227:342192.168.1.3:342    209.165.200.1:342  209.165.200.1:342
icmp 209.165.200.227:343192.168.1.3:343    209.165.200.1:343  209.165.200.1:343
icmp 209.165.200.227:46192.168.1.11:46    209.165.200.1:46   209.165.200.1:46
icmp 209.165.200.227:47192.168.1.11:47    209.165.200.1:47   209.165.200.1:47
icmp 209.165.200.227:48192.168.1.11:48    209.165.200.1:48   209.165.200.1:48
icmp 209.165.200.227:49192.168.1.11:49    209.165.200.1:49   209.165.200.1:49
icmp 209.165.200.227:50192.168.1.11:50    209.165.200.1:50   209.165.200.1:50
```

Как мы видим, все локальные адреса преобразовались в один глобальный адрес из пула 209.165.200.227, а идентификация происходит по порту (или в данном случае по ID icmp сообщений, так как в icmp нет портов).

## 3. Настройка и проверка статического PAT по адресу интерфейса.

